---
type: PointNode
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# PointNode

`Autodesk.Revit.DB.PointNode` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetPoint | 2016 | `public Point GetPoint ()` |